using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ClassLibraryTRPOLR2
{
    public class Пара
    {
        public int ЧасыНачалаПары { get; }
        public int МинутыНачалаПары { get; }
        public int ЧасыКонцаПары { get; }
        public int МинутыКонцаПары { get; }
        public int ЧасыНачалаПерерыва { get; }
        public int МинутыНачалаПерерыва { get; }
        public int ЧасыКонцаПерерыва { get; }
        public int МинутыКонцаПерерыва { get; }
        public Смена Смена { get; }
        public Пара(int часыНачалаПары, int минутыНачалаПары, int часыКонцаПары, int минутыКонцаПары,
            int часыНачалаПерерыва, int минутыНачалаПерерыва, int часыКонцаПерерыва, int минутыКонцаПерерыва, Смена смена)
        {
            ЧасыНачалаПары = часыНачалаПары;
            МинутыНачалаПары = минутыНачалаПары;
            ЧасыКонцаПары = часыКонцаПары;
            МинутыКонцаПары = минутыКонцаПары;
            ЧасыНачалаПерерыва = часыНачалаПерерыва;
            МинутыНачалаПерерыва = минутыНачалаПерерыва;
            ЧасыКонцаПерерыва = часыКонцаПерерыва;
            МинутыКонцаПерерыва = минутыКонцаПерерыва;
            Смена = смена;
        }
    }
}
